{
  "search_query": "系统架构",
  "retrieved_count": 10,
  "retrieved_experiences": [
    "Use flowchart with subgraphs for modular components, directional arrows for relationships, and class definitions for styling.",
    "Used a flowchart (graph TD) to visualize hierarchical and interconnected components, with subgraphs for modular organization, arrows to indicate data flow (e.g., HTTP requests, system calls), and labels for clarity in depicting multi-layer system interactions.",
    "Used flowchart to visualize dependencies and nested subgraphs for clarity; hierarchical layout with arrows indicates direction of dependencies, and subgraphs organize modules into internal components for detailed structure.",
    "Use graph TD with nested nodes and clear branching to represent parent-child relationships and categories.",
    "Used ClassDiagram to model entities and relationships, showing UserTable as main class with attributes and Preferences as a separate class linked via composition to illustrate data structure and associations clearly.",
    "Use flowchart with subgraphs and custom styling to represent hierarchical components and processes",
    "Use graph TB with subgraphs and custom styling classes to visualize hierarchical phases and component relationships.",
    "Used a top-to-bottom flowchart (graph TB) to visualize the hierarchical and directional flow of components, including external services, frontend, backend services, databases, and monitoring. Layout organizes services logically with subgraphs for grouping, and styling with distinct colors enhances readability by categorizing components (e.g., frontend, backend, external). Key features include clear directional arrows for API calls, service-to-service communication, and monitoring connections to illustrate data flow and dependencies.",
    "Used a directed graph (graph TD) to illustrate the sequential flow of data and key components in a trading system, with subgraphs to group related elements (e.g., main components and data flow) for clarity and organization.",
    "Used a TD (Top-Down) flowchart to illustrate hierarchical and directional relationships between modules, with subgraphs for logical grouping (Client Side, Backend, Infra) and dashed/straight arrows to denote different types of interactions (e.g., HTTP requests, data flow)."
  ]
}